OpenFOAM-5.x/tutorials/demo/pimpleCoronary/system/GeometryFiles
"constant/surfaces/Cap_Aorta_Inlet.stl" 
"constant/surfaces/Cap_Aorta_Outlet.stl" 
"constant/surfaces/Cap_LAD_D1.stl" 
"constant/surfaces/Cap_LAD_D2.stl" 
"constant/surfaces/Cap_LAD_D3.stl" 
"constant/surfaces/Cap_LAD_D4.stl" 
"constant/surfaces/Cap_LAD_LAD.stl" 
"constant/surfaces/Cap_LAD_RI.stl" 
"constant/surfaces/Cap_LAD_S1.stl" 
"constant/surfaces/Cap_LCX_LCx.stl" 
"constant/surfaces/Cap_RCA_R_PDA.stl" 
"constant/surfaces/Cap_RCA_R_PDA2.stl" 
"constant/surfaces/Cap_RCA_R_PLB.stl" 
"constant/surfaces/Cap_RCA_R_PLB2.stl" 
"constant/surfaces/Cap_RCA_R_PLB3.stl" 
"constant/surfaces/Cap_RCA_RA1.stl" 
"constant/surfaces/Wall_Aorta.stl" 
