OpenFOAM-5.x/tutorials/demo/pimpleCoronary/system/MeshingInfo
baseGridSize 0.0035;
