OpenFOAM-5.x/tutorials/demo/pimpleCoronary/system/numberOfSubdomains
numberOfSubdomains 8;
