OpenFOAM-5.x/tutorials/demo/pimpleCoronary/system/processorWeights
processorWeights ( 1 1 1 1 1 1 1 1);
